cask_args appdir: '/Applications'

tap "cloudfoundry/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sanemat/font"
tap "mutagen-io/mutagen"
brew "ansible"
brew "autoconf"
brew "autojump"
brew "automake"
brew "boost"
brew "cmigemo"
brew "ctags"
brew "curl"
brew "direnv"
brew "libtool"
brew "gdal"
brew "gibo"
brew "git"
brew "go"
brew "graphviz"
brew "hub"
brew "hugo"
brew "jq"
brew "lv"
brew "mackup"
brew "mas"
brew "p7zip"
brew "peco"
brew "plantuml"
brew "redis"
brew "tfenv"
brew "the_platinum_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "rust"
brew "shellcheck"
brew "ghq"
brew "git-secrets"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
brew "cloudfoundry/tap/cf-cli"
brew "heroku/brew/heroku"
brew "sanemat/font/ricty"
brew "mutagen-io/mutagen/mutagen", args: ["devel"]
cask "docker"
cask "font-ricty-diminished"
cask "java"
cask "Alfred"
cask "iterm2"
cask "google-chrome"
cask "dropbox"
cask "visual-studio-code"
cask "vivaldi"
cask "bartender"
cask "google-backup-and-sync"
cask "bettertouchtool"
cask "boostnote"
cask "box-drive"
cask "box-edit"
cask "clipy"
cask "discord"
cask "drawio"
cask "dropbox"
cask "karabiner-elements"
cask "microsoft-edge"
cask "notion"
cask "sourcetree"
cask "textexpander"
cask "vlc"
cask "atok"
cask "deepl"
cask "masscode"
# mas "Day One", id: 1055511498
# mas "Evernote", id: 406056744
# mas "Fantastical", id: 975937182
# mas "GoodNotes", id: 1480793815
# mas "iA Writer", id: 775737590
# mas "iMovie", id: 408981434
# mas "Jump Desktop", id: 524141863
# mas "Keynote", id: 409183694
# mas "Kindle", id: 405399194
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft OneNote", id: 784801555
# mas "Microsoft Outlook", id: 985367838
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Remote Desktop", id: 1295203466
# mas "Microsoft Word", id: 462054704
# mas "Numbers", id: 409203825
# mas "OmniFocus", id: 1346203938
# mas "OneDrive", id: 823766827
# mas "Pages", id: 409201541
# mas "PopClip", id: 445189367
# mas "Scrivener 3", id: 1310686187
# mas "Slack", id: 803453959
# mas "Spark", id: 1176895641
# mas "The Unarchiver", id: 425424353
